name: "santacoder_huggingface_stream"
backend: "python"

instance_group [
    {
      count: 1
      kind: KIND_GPU
      gpus: [ 0 ]
    }
]

input: [
  {
    name: "input",
    data_type: TYPE_STRING,
    dims: [1]
  }
]

output: [
  {
    name: "output",
    data_type: TYPE_STRING,
    dims: [1]
  }
]

dynamic_batching { 
  max_queue_delay_microseconds: 100000
}

model_transaction_policy {
  decoupled: True
}